[
    {
      "overview": "How do successful companies create products people can’t put down?Why do some products capture widespread attention while others flop? What makes us engage with certain products out of sheer habit? Is there a pattern underlying how technologies hook us?Nir Eyal answers these questions (and many more) by explaining the “Hook Model”—a four steps process embedded into the products of many successful companies to subtly encourage customer behavior. Through consecutive “hook cycles,” these products reach their ultimate goal of bringing users back over and over again, without depending on costly advertising or aggressive messaging.",
      "author": ["Nir Eyal", "Ryan Hoover"],
      "poster_path": "https://m.media-amazon.com/images/I/41cwlw8NwdL._SL500_.jpg",
      "publish_date": "2020-12-16",
      "title": "Hooked",
      "subtitle": "How to Build Habit-Forming Products",
      "rate": 4.83,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 12,
          "name": "Adventure"
        },
        {
          "id": 14,
          "name": "Fantasy"
        }
      ]
    },
    {
      "overview": "Since Don’t Make Me Think was first published in 2000, hundreds of thousands of Web designers and developers have relied on usability guru Steve Krug’s guide to help them understand the principles of intuitive navigation and information design. Witty, commonsensical, and eminently practical, it’s one of the best-loved and most recommended books on the subject.",
      "author": "Steve Krug",
      "poster_path": "https://m.media-amazon.com/images/I/51xzVPaFhfL._SL500_.jpg",
      "publish_date": "2013-01-29",
      "title": "Don't Make Me Think",
      "subtitle": "A Common Sense Approach to Web Usability",
      "rate": 4.42,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 80,
          "name": "Crime"
        },
        {
          "id": 53,
          "name": "Thriller"
        }
      ]
    },
    {
      "overview": "Talking to people about your designs might seem like a basic skill, but it can be difficult to do well. In many cases, how you communicate with stakeholders, clients, and other nondesigners may be more important than the designs themselves. Because if you can't get their support, your work will never see the light of day--no matter how good it is.",
      "author": "Tom Greever",
      "poster_path": "https://m.media-amazon.com/images/I/51xPg5N1BXL._SL500_.jpg",
      "publish_date": "2020-01-27",
      "title": "Articulating Design Decisions",
      "subtitle": "Communicate with Stakeholders, Keep Your Sanity, and Deliver the Best User Experience",
      "rate": 4.29,
      "genres": [
        {
          "id": 80,
          "name": "Crime"
        },
        {
          "id": 53,
          "name": "Thriller"
        }
      ]
    },
    {
      "overview": "One key responsibility of product designers and UX practitioners is to conduct formal and informal research to clarify design decisions and business needs. But there’s often mystery around product research, with the feeling that you need to be a research Zen master to gather anything useful. Fact is, anyone can conduct product research. With this quick reference guide, you’ll learn a common language and set of tools to help you carry out research in an informed and productive manner.",
      "author": ["Brad Nunnally", "David Farkas"],
      "poster_path": "https://m.media-amazon.com/images/I/51JaVNwtcNL._SL500_.jpg",
      "publish_date": "2016-01-15",
      "title": "UX Research",
      "subtitle": "Practical Techniques for Designing Better Products",
      "rate": 4.16,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 878,
          "name": "Science Fiction"
        },
        {
          "id": 53,
          "name": "Thriller"
        }
      ]
    },
    {
      "overview": "The User Experience Team of One prescribes a range of approaches that have big impact and take less time and fewer resources than the standard lineup of UX deliverables. Whether you want to cross over into user experience or you're a seasoned practitioner trying to drag your organization forward, this book gives you tools and insight for doing more with less.",
      "author": "Leah Buley",
      "poster_path": "https://m.media-amazon.com/images/I/51kmwVZ0y7L._SL500_.jpg",
      "publish_date": "2013-07-09",
      "title": "The User Experience Team of One",
      "subtitle":  "A Research and Design Survival Guide",
      "rate": 4.6,
      "genres": [
        {
          "id": 12,
          "name": "Adventure"
        },
        {
          "id": 27,
          "name": "Horror"
        },
        {
          "id": 53,
          "name": "Thriller"
        }
      ]
    },
    {
      "overview": "A hardened mechanic must stay awake and maintain an interstellar ark fleeing the dying planet Earth with a few thousand lucky souls on board... the last of humanity. Unfortunately, humans are not the only passengers. A shapeshifting alien creature has taken residence, its only goal is to kill as many people as possible. The crew must think quickly to stop this menace before it destroys mankind.",
      "author": ["James Kalbach", "Aaron Gustafson" ],
      "poster_path": "https://m.media-amazon.com/images/I/515WRnKBVsL._SL500_.jpg",
      "publish_date": "2007-12-17",
      "title": "Designing Web Navigation",
      "subtitle": "Optimizing the User Experience",
      "rate": 3.86,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 878,
          "name": "Science Fiction"
        }
      ]
    },
    {
      "overview": "Presents an introduction to interaction design frameworks and how to use them to develop effective Web sites.",
      "author": ["Robert Hoekman Jr.", "Jared Spool"],
      "poster_path": "https://m.media-amazon.com/images/I/41aVmN7+KSL._SL500_.jpg",
      "publish_date": "2009-10-25",
      "title": "Web Anatomy",
      "subtitle": "Interaction Design Frameworks That Work",
      "rate": 3.96,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 878,
          "name": "Science Fiction"
        }
      ]
    },
    {
      "overview": "One of the best ways is to understand users' reasons for doing things. Mental Models gives you the tools to help you grasp, and design for, those reasons. Adaptive Path co-founder Indi Young has written a roll-up-your-sleeves book for designers, managers, and anyone else interested in making design strategic, and successful.",
      "author": "Indi Young",
      "poster_path": "https://m.media-amazon.com/images/I/41UtudWlnNL._SL500_.jpg",
      "publish_date": "2011-09-30",
      "title": "Mental Models",
      "subtitle": "Aligning Design Strategy with Human Behavior",
      "rate": 4.34,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 12,
          "name": "Adventure"
        },
        {
          "id": 80,
          "name": "Crime"
        }
      ]
    },
    {
      "overview": "The A-to-Z guide to spotting and fixing usability problems  Frustrated by pop-ups? Forms that make you start over if you miss a field? Nonsensical error messages? You're not alone! This book helps you simply get it right the first time (or fix what's broken). Boasting a full-color interior packed with design and layout examples, this book teaches you how to understand a user's needs, divulges techniques for exceeding a user's expectations, and provides a host of hard won advice for improving the overall quality of a user's experience.",
      "author": "Eric Reiss",
      "poster_path": "https://m.media-amazon.com/images/I/41OJRDq79xL._SL500_.jpg",
      "publish_date": "2012-12-25",
      "title": "Usable Usability",
      "subtitle": "Simple Steps for Making Stuff Better",
      "rate": 3.96,
      "genres": [
        {
          "id": 16,
          "name": "Animation"
        },
        {
          "id": 35,
          "name": "Comedy"
        },
        {
          "id": 18,
          "name": "Drama"
        },
        {
          "id": 10751,
          "name": "Family"
        },
        {
          "id": 14,
          "name": "Fantasy"
        },
        {
          "id": 10402,
          "name": "Music"
        }
      ]
    },
    {
      "overview": "The Design of Sites, Second Edition, is the definitive reference for the principles, patterns, methodologies, and best practices underlying exceptional Web design. If you are involved in the creation of dynamic Web sites, this book will give you all the necessary tools and techniques to create effortless end-user Web experiences, improve customer satisfaction, and achieve a balanced approach to Web design.",
      "author": ["Douglas Van Duyne", "James Landay", "Jason Hong"],
      "poster_path": "https://m.media-amazon.com/images/I/41AR2aFaLjL._SL500_.jpg",
      "publish_date": "2006-01-29",
      "title": "The Design of Sites",
      "subtitle": "Patterns for Creating Winning Web Sites",
      "rate": 3.96,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 12,
          "name": "Adventure"
        },
        {
          "id": 35,
          "name": "Comedy"
        },
        {
          "id": 10751,
          "name": "Family"
        }
      ]
    },
    {
      "overview": "Today, top-flight software must feature a desirable user experience. This one-of-a-kind book creates a design process specifically for software, making it easy for developers who lack design background to create that compelling user experience. Appealing to both tech-savvy designers and creative-minded technologists, it establishes a hybrid discipline that will produce first-rate software. Illustrated in full color, it shows how to plan and visualize the design to create software that works on every level.",
      "author": "Erik Klimczak",
      "poster_path": "https://m.media-amazon.com/images/I/41ROuvGqSsL._SL500_.jpg",
      "publish_date": "2013-08-22",
      "title": "Design for Software",
      "subtitle": "A Playbook for Developers",
      "rate": 4,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 878,
          "name": "Science Fiction"
        },
        {
          "id": 53,
          "name": "Thriller"
        }
      ]
    },
    {
      "overview": "Great user experiences (UX) are essential for products today, but designing one can be a lengthy and expensive process. With this practical, hands-on book, you’ll learn how to do it faster and smarter using Lean UX techniques. UX expert Laura Klein shows you what it takes to gather valuable input from customers, build something they’ll truly love, and reduce the time it takes to get your product to market.",
      "author": "Laura Klein",
      "poster_path": "https://m.media-amazon.com/images/I/41KZdlWAodL._SL500_.jpg",
      "publish_date": "2013-02-05",
      "title": "UX for Lean Startups",
      "subtitle": "Faster, Smarter User Experience Research and Design",
      "rate": 4.11,
      "genres": [
        {
          "id": 18,
          "name": "Drama"
        },
        {
          "id": 14,
          "name": "Fantasy"
        },
        {
          "id": 878,
          "name": "Science Fiction"
        }
      ]
    },
    {
      "overview": "We all use stories to communicate, explore, persuade, and inspire. In user experience, stories help us to understand our users, learn about their goals, explain our research, and demonstrate our design ideas. In this book, Quesenbery and Brooks teach you how to craft and tell your own unique stories to improve your designs. Testimonials - Stories facilitate a level of communication that is as close to telepathy as you can get. Kevin and Whitney guide you to use storytelling in `how to' scenarios so smoothly that you may never realize how far you leapfrogged ahead and never know the mistakes you didn't make because of this book. It's that good.",
      "author": ["Whitney Quesenbery", "Kevin Brook"],
      "poster_path": "https://m.media-amazon.com/images/I/41SrpbL3pIL._SL500_.jpg",
      "publish_date": "2011-12-19",
      "title": "Storytelling for User Experience",
      "subtitle": "Crafting Stories for Better Design",
      "rate": 4,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 12,
          "name": "Adventure"
        },
        {
          "id": 53,
          "name": "Thriller"
        }
      ]
    },
    {
      "overview": "Digital Design Essentials takes a practical, highly accessible approach to creating graphical user interface designs for desktop, mobile, and touch screen devices. Written by an expert in the realm of digital design, this comprehensive, step-by-step guide demonstrates how to apply design principles in a variety of desktops, web pages, mobile devices and other touchscreens. Filled with straightforward strategies in a visual format, it's an essential volume for any designer working in the digital realm. Book resources can be found at DesignUserInterface.com ",
      "author": "Rajesh Lal",
      "poster_path": "https://m.media-amazon.com/images/I/51yH7AGr7uL._SL500_.jpg",
      "publish_date": "2013-07-02",
      "title": "Digital Design Essentials",
      "subtitle": "100 Ways to Design Better Desktop, Web, and Mobile Interfaces",
      "rate": 3.79,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 80,
          "name": "Crime"
        },
        {
          "id": 18,
          "name": "Drama"
        },
        {
          "id": 53,
          "name": "Thriller"
        }
      ]
    },
    {
      "overview": "User experience (UX) strategy lies at the intersection of UX design and business strategy, but until now, there hasn't been an easy-to-apply framework for executing it. This hands-on guide introduces lightweight product strategy tools and techniques to help you and your team devise innovative digital solutions that people want.",
      "author": "Jaime Levy",
      "poster_path": "https://m.media-amazon.com/images/I/418REJhQ1vL._SL500_.jpg",
      "publish_date": "2021-09-03",
      "title": "UX Strategy",
      "subtitle": "Product Strategy Techniques for Devising Innovative Digital Solutions",
      "rate": 4.29,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 80,
          "name": "Crime"
        },
        {
          "id": 18,
          "name": "Drama"
        },
        {
          "id": 53,
          "name": "Thriller"
        }
      ]
    },
    {
      "overview": "This book is for organisations starting their UX journey. It will help to address the basics such as defining what UX is; the importance of research; how UX is a process and not a job title; and where business value comes from improving efficiency, effectiveness, and satisfaction. There is practical guidance for building a business case and identifying the key investments required in people and process that will bring about the change needed to deliver success. Implementing UX is brought to life through the UX Lifecycle, a methodology framework that was born out of real life successes.",
      "author": ["Jereny Baines", "Clive Howard"],
      "poster_path": "https://m.media-amazon.com/images/I/41YCPx25SIL._SL500_.jpg",
      "publish_date": "2016-06-26",
      "title": "UX Lifecycle",
      "subtitle": "The business guide to implementing great software user experiences",
      "rate": 4.11,
      "genres": [
        {
          "id": 16,
          "name": "Animation"
        },
        {
          "id": 10751,
          "name": "Family"
        },
        {
          "id": 14,
          "name": "Fantasy"
        }
      ]
    },
    {
      "overview": "Eye tracking is a widely used research method, but there are many questions and misconceptions about how to effectively apply it. Eye Tracking the User Experience—the first how-to book about eye tracking for UX practitioners—offers step-by-step advice on how to plan, prepare, and conduct eye tracking studies; how to analyze and interpret eye movement data; and how to successfully communicate eye tracking findings.",
      "author": "Aga Bojko",
      "poster_path": "https://m.media-amazon.com/images/I/517wHMBofzL._SL500_.jpg",
      "publish_date": "2013-11-25",
      "title": "Eye Tracking the User Experience",
      "subtitle": "A Practical Guide to Research",
      "rate": 4.06,
      "genres": [
        {
          "id": 12,
          "name": "Adventure"
        },
        {
          "id": 16,
          "name": "Animation"
        },
        {
          "id": 10751,
          "name": "Family"
        },
        {
          "id": 14,
          "name": "Fantasy"
        }
      ]
    },
    {
      "overview": "Welcome to our multi-device world, a world where a user’s experience with one application can span many devices―a smartphone, a tablet, a computer, the TV, and beyond. This practical book demonstrates the variety of ways devices relate to each other, combining to create powerful ensembles that deliver superior, integrated experiences to your users.",
      "author": "Michal Levin",
      "poster_path": "https://m.media-amazon.com/images/I/51CiLV6QlRL._SL500_.jpg",
      "publish_date": "2014-10-01",
      "title": "Designing Multi-Device Experiences",
      "subtitle": "An Ecosystem Approach to User Experiences across Devices",
      "rate": 4.09,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 53,
          "name": "Thriller"
        }
      ]
    },
    {
      "overview": "The book explains best practice user experience design and usability testing tools and techniques such as: Wireframes, Personas ect. It also includes international UX and usability principles and guidelines mainly based on UXPA (User Experience Professionals Association) standards. Sample project documents, diagrams and user interface designs are used to better explain these tools, techniques, methods and guidelines.",
      "author": "Emrah Yayici",
      "poster_path": "https://m.media-amazon.com/images/I/41uz-sJGp6L._SL500_.jpg",
      "publish_date": "2014-07-29",
      "title": "UX Design and Usability Mentor Book",
      "subtitle": "With Best Practice Business Analysis and User Interface Design Tips and Techniques",
      "rate": 4.02,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 53,
          "name": "Thriller"
        }
      ]
    },
    {
      "overview": "When you’re under pressure to produce a well-designed, easy-to-navigate mobile app, there’s no time to reinvent the wheel―and no need to. This handy reference provides more than 90 mobile app design patterns, illustrated by 1,000 screenshots from current Android, iOS, and Windows Phone apps.",
      "author": "Theresa Neil",
      "poster_path": "https://m.media-amazon.com/images/I/51VHDfkLg9L._SL500_.jpg",
      "publish_date": "2014-12-04",
      "title": "Mobile Design Pattern Gallery",
      "subtitle": "UI Patterns for SmartPhone Apps",
      "rate": 4.06,
      "genres": [
        {
          "id": 27,
          "name": "Horror"
        },
        {
          "id": 9648,
          "name": "Mystery"
        }
      ]
    },
    {
      "original_title": "Birds of Prey (and the Fantabulous Emancipation of One Harley Quinn)",
      "overview": "Neuro Web Design employs “neuro-marketing” concepts, which are at the intersection of psychology and user experience. It’s scientific, yet you’ll find it accessible, easy to read, and easy to understand. By applying the concepts and examples in this book, you’ll be able to dramatically increase the effectiveness and conversion rates of your own Web site.",
      "poster_path": "https://m.media-amazon.com/images/I/41kQEHVDV9L._SL500_.jpg",
      "publish_date": "2009-02-05",
      "title": "Neuro Web Design",
      "subtitle": "What Makes Them Click?",
      "rate": 4.03,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 80,
          "name": "Crime"
        }
      ]
    },
    {
      "overview": "The intersection of the customer, user and technology is at the heart of this concise guidebook for developing easy to use software. In Easy to Use 2.0, Sean Van Tyne expands on his previous edition, taking the complex topic of agile development for enterprise software and making it easy to understand and easy to implement. Easy to Use 2.0 is an easy to use guide to creating simple yet effective enterprise applications.",
      "author": "Sean Van Tyne",
      "poster_path": "https://m.media-amazon.com/images/I/411e-5IJ2LL._SL500_.jpg",
      "publish_date": "2017-09-26",
      "title": "Easy to Use 2.0",
      "subtitle": "User Experience in Agile Development for Enterprise Software",
      "rate": 4.09,
      "genres": [
        {
          "id": 16,
          "name": "Animation"
        },
        {
          "id": 10751,
          "name": "Family"
        }
      ]
    },
    {
      "overview": "As a web designer, you encounter tough choices when it comes to weighing aesthetics and performance. Good content, layout, images, and interactivity are essential for engaging your audience, and each of these elements have an enormous impact on page load time and the end-user experience. In this practical book, Lara Hogan helps you approach projects with page speed in mind, showing you how to test and benchmark which design choices are most critical.",
      "author": "Lara Callender Hogan",
      "poster_path": "https://m.media-amazon.com/images/I/51FOKng5obL._SL500_.jpg",
      "publish_date": "2020-08-07",
      "title": "Designing for Performance",
      "subtitle": "Weighing Aesthetics and Speed",
      "rate": 4.06,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 80,
          "name": "Crime"
        },
        {
          "id": 18,
          "name": "Drama"
        }
      ]
    },
    {
      "overview": "It's been known for years that usability testing can dramatically improve products. But with a typical price tag of $5,000 to $10,000 for a usability consultant to conduct each round of tests, it rarely happens.",
      "author": "Steve Krug",
      "poster_path": "https://m.media-amazon.com/images/I/51474AdgNRL._SL500_.jpg",
      "publish_date": "2009-05-29",
      "title": "Rocket Surgery Made Easy",
      "subtitle": "The Do-It-Yourself Guide to Finding and Fixing Usability Problems",
      "rate": 4.11,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 878,
          "name": "Science Fiction"
        }
      ]
    },
    {
      "overview": "Without words, apps would be an unusable jumble of shapes and icons, while voice interfaces and chatbots wouldn't even exist. Words make software human–centered, and require just as much thought as the branding and code. This book will show you how to give your users clarity, test your words, and collaborate with your team. You'll see that writing is designing.",
      "poster_path": "https://m.media-amazon.com/images/I/41vVAFSXvZL._SL500_.jpg",
      "publish_date": "2020-05-08",
      "title": "Writing Is Designing",
      "subtitle": "Words and the User Experience",
      "rate": 4.22,
      "genres": [
        {
          "id": 28,
          "name": "Action"
        },
        {
          "id": 12,
          "name": "Adventure"
        },
        {
          "id": 36,
          "name": "History"
        }
      ]
    },
    {
      "overview": "Networked thermostats, fitness monitors, and door locks show that the Internet of Things can (and will) enable new ways for people to interact with the world around them. But designing connected products for consumers brings new challenges beyond conventional software UI and interaction design.",
      "author": ["Claire Rowland", "Elizabeth Goodman", "Martin Charlier", "Ann Light"],
      "poster_path": "https://m.media-amazon.com/images/I/51ddn+Ojj8L._SL500_.jpg",
      "publish_date": "2015-02-05",
      "title": "Designing COnnected Products",
      "subtitle": "UX for the Consumer Internet of Things",
      "rate": 4.2,
      "genres": [
        {
          "id": 18,
          "name": "Drama"
        },
        {
          "id": 10749,
          "name": "Romance"
        },
        {
          "id": 878,
          "name": "Science Fiction"
        }
      ]
    }
  ]
  